<h2 align='center' style='color:green'>Data Preprocessing</h2>

In [62]:
import pandas as pd

<h5 style='color:saddlebrown'>Create DF</h5>

In [63]:
CusAdd = pd.read_excel("E:/0 Univer/Junior/Cap1/Dataset/Bicycle.xlsx", sheet_name="CustomerAdress")
CusDemo = pd.read_excel("E:/0 Univer/Junior/Cap1/Dataset/Bicycle.xlsx", sheet_name="Customer Demographic")
CusList = pd.read_excel("E:/0 Univer/Junior/Cap1/Dataset/Bicycle.xlsx", sheet_name="CustomerList")
Transactions = pd.read_excel("E:/0 Univer/Junior/Cap1/Dataset/Bicycle.xlsx", sheet_name="Transactions")

C:\Users\phanc\AppData\Local\Temp\ipykernel_236\3526355941.py:2: FutureWarning: Inferring datetime64[ns] from data containing strings is deprecated and will be removed in a future version. To retain the old behavior explicitly pass Series(data, dtype=datetime64[ns])
  CusDemo = pd.read_excel("E:/0 Univer/Junior/Cap1/Dataset/Bicycle.xlsx", sheet_name="Customer Demographic")

<h5 style='color:saddlebrown'>Check null value</h5>

In [64]:
CusAdd.isnull().sum().sort_values(ascending= False)

customer_id    0
address        0
postcode       0
state          0
country        0
dtype: int64

In [65]:
CusDemo.isnull().sum().sort_values(ascending= False)
# CusDemo[CusDemo.isnull().any(axis=1)].head(2)

job_industry_category                  656
job_title                              506
last_name                              125
DOB                                     87
customer_id                              0
first_name                               0
gender                                   0
past_3_years_bike_related_purchases      0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
dtype: int64

In [66]:
CusList.isnull().sum().sort_values(ascending= False)
# CusList[CusList.isnull().any(axis=1)].head(2)

job_industry_category                  165
job_title                              106
last_name                               29
DOB                                     17
first_name                               0
gender                                   0
past_3_years_bike_related_purchases      0
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
address                                  0
postcode                                 0
state                                    0
country                                  0
dtype: int64

In [67]:
Transactions.isnull().sum().sort_values(ascending= False)
# Transactions[Transactions.isnull().any(axis=1)].head()

online_order        360
brand               197
product_line        197
product_class       197
product_size        197
standard_cost       197
transaction_id        0
product_id            0
customer_id           0
transaction_date      0
order_status          0
list_price            0
dtype: int64

##### Delete invalid rows

In [68]:
Transactions.shape

(20000, 12)

In [69]:
Transactions.dropna(subset=["brand"], inplace=True)

In [70]:
Transactions.shape

(19803, 12)

In [71]:
Transactions.isnull().sum().sort_values(ascending= False)

online_order        358
transaction_id        0
product_id            0
customer_id           0
transaction_date      0
order_status          0
brand                 0
product_line          0
product_class         0
product_size          0
list_price            0
standard_cost         0
dtype: int64

<h5 style='color:saddlebrown'>Create new columns</h5>

##### Add Name column

In [72]:
CusDemo["Name"] = CusDemo["first_name"] + " " + CusDemo["last_name"]

In [73]:
# CusList["Name"] = CusList["first_name"] + " " + CusList["last_name"]

In [74]:
# CusList.head(2)

##### Add Age and Age_Group column

In [75]:
from datetime import date

In [76]:
def AgeCal(DOB):
    today = date.today()
    age = today.year - DOB.year
    return age

***

CusDemo

***

In [77]:
Age = CusDemo["DOB"].apply(AgeCal)

In [78]:
# Add Age column 
CusDemo["Age"] = Age

In [79]:
# Fill null age values with age mean
CusDemo["Age"].fillna(CusDemo["Age"].mean(), inplace=True)

In [80]:
CusDemo["Age"].describe()

count    4000.000000
mean       44.969333
std        12.656426
min        20.000000
25%        36.000000
50%        45.000000
75%        54.000000
max       179.000000
Name: Age, dtype: float64

In [81]:
# Create bins for Age_Group column
bins = [18, 25, 40, 60, 200]
labels = ['young', 'adult', 'middle-aged', 'old']

In [82]:
# Add Age_Group column 
CusDemo["Age_Group"] = pd.cut(CusDemo["Age"], bins=bins, labels=labels, include_lowest = True)

In [83]:
CusDemo.head(2)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,Name,Age,Age_Group
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,Laraine Medendorp,69.0,old
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,Eli Bockman,42.0,middle-aged

##### Adjust Gender Column

In [84]:
CusDemo["gender"].unique()

array(['F', 'Male', 'Female', 'U', 'Femal', 'M'], dtype=object)

In [85]:
# F, Femal --> Female; M --> Male

In [86]:
CusDemo["gender"].replace("F", "Female", inplace=True)
CusDemo["gender"].replace("Femal", "Female", inplace=True)
CusDemo["gender"].replace("M", "Male", inplace=True)

In [87]:
CusDemo["gender"].unique()

array(['Female', 'Male', 'U'], dtype=object)

In [88]:
CusDemo.head(2)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,Name,Age,Age_Group
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,Laraine Medendorp,69.0,old
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,Eli Bockman,42.0,middle-aged

##### Add Profit Column

In [89]:
Transactions["Profit"] = Transactions["list_price"] - Transactions["standard_cost"]

In [90]:
Transactions["Profit"].head(2)

0      17.87
1    1702.55
Name: Profit, dtype: float64

In [91]:
CusAdd["customer_id"].nunique()

3999

In [92]:
CusDemo["customer_id"].nunique()

4000

##### Join two sheets

In [93]:
NewCusDemo = CusDemo.merge(CusAdd, on='customer_id')

In [94]:
NewCusDemo.head(2)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,Name,Age,Age_Group,address,postcode,state,country
0,1,Laraine,Medendorp,Female,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,Laraine Medendorp,69.0,old,060 Morning Avenue,2016,New South Wales,Australia
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,Eli Bockman,42.0,middle-aged,6 Meadow Vale Court,2153,New South Wales,Australia

##### Adjust State Column

In [95]:
NewCusDemo["state"].unique()

array(['New South Wales', 'QLD', 'VIC', 'NSW', 'Victoria'], dtype=object)

In [96]:
# NewCusDemo[NewCusDemo["state"].isna()].shape

In [97]:
# nan --> Mode 
# NSW --> New South Wales
# VIC --> Victoria
# QLD --> Queensland

In [98]:
NewCusDemo["state"].replace("NSW", "New South Wales", inplace=True)
NewCusDemo["state"].replace("VIC", "Victoria", inplace=True)
NewCusDemo["state"].replace("QLD", "QueensLand", inplace=True)

In [99]:
NewCusDemo["state"].mode()

0    New South Wales
Name: state, dtype: object

In [100]:
import numpy as np

In [101]:
# # Replace nan value in state column by New South Wales (mode)
# NewCusDemo["state"].replace(np.nan, "New South Wales", inplace=True)

In [102]:
NewCusDemo["state"].unique()

array(['New South Wales', 'QueensLand', 'Victoria'], dtype=object)

In [103]:
NewCusDemo.isnull().sum().sort_values(ascending= False)

job_industry_category                  655
job_title                              504
Name                                   125
last_name                              125
DOB                                     87
customer_id                              0
state                                    0
postcode                                 0
address                                  0
Age_Group                                0
Age                                      0
deceased_indicator                       0
owns_car                                 0
first_name                               0
wealth_segment                           0
past_3_years_bike_related_purchases      0
gender                                   0
country                                  0
dtype: int64

##### Adjust job_industry_category Column

In [104]:
NewCusDemo["job_industry_category"].unique()

array(['Health', 'Financial Services', 'IT', nan, 'Retail', 'Argiculture',
       'Property', 'Manufacturing', 'Telecommunications', 'Entertainment'],
      dtype=object)

In [105]:
# nan --> other industries

In [106]:
NewCusDemo["job_industry_category"].replace(np.nan, "Other industries", inplace=True)

In [107]:
NewCusDemo["job_industry_category"].unique()

array(['Health', 'Financial Services', 'IT', 'Other industries', 'Retail',
       'Argiculture', 'Property', 'Manufacturing', 'Telecommunications',
       'Entertainment'], dtype=object)

In [108]:
NewCusDemo.isnull().sum().sort_values(ascending= False)

job_title                              504
Name                                   125
last_name                              125
DOB                                     87
customer_id                              0
state                                    0
postcode                                 0
address                                  0
Age_Group                                0
Age                                      0
deceased_indicator                       0
owns_car                                 0
first_name                               0
wealth_segment                           0
job_industry_category                    0
past_3_years_bike_related_purchases      0
gender                                   0
country                                  0
dtype: int64

In [109]:
Transactions.isnull().sum().sort_values(ascending= False)

online_order        358
transaction_id        0
product_id            0
customer_id           0
transaction_date      0
order_status          0
brand                 0
product_line          0
product_class         0
product_size          0
list_price            0
standard_cost         0
Profit                0
dtype: int64

##### Check Profit of "Cancel order"

In [110]:
Transactions[Transactions["order_status"] == "Cancelled"].head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,Profit
42,43,76,488,2017-03-17,0.0,Cancelled,WeareA2B,Standard,low,medium,642.31,513.85,128.46
138,139,32,2073,2017-03-25,0.0,Cancelled,Giant Bicycles,Standard,high,medium,1179.00,707.40,471.60

##### Set Profit of "Cancelled order" = 0

In [111]:
Transactions['Profit'].mask(Transactions['order_status'] == 'Cancelled', 0, inplace=True)

In [112]:
Transactions['list_price'].mask(Transactions['order_status'] == 'Cancelled', 0, inplace=True)

In [113]:
Transactions[Transactions["order_status"] == "Cancelled"].head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost,Profit
42,43,76,488,2017-03-17,0.0,Cancelled,WeareA2B,Standard,low,medium,0.0,513.85,0.0
138,139,32,2073,2017-03-25,0.0,Cancelled,Giant Bicycles,Standard,high,medium,0.0,707.40,0.0

In [114]:
Transactions.drop(Transactions[Transactions["order_status"] == "Cancelled"].index, inplace=True)

In [115]:
Transactions[Transactions["order_status"] == "Cancelled"].head(2)

Empty DataFrame
Columns: [transaction_id, product_id, customer_id, transaction_date, online_order, order_status, brand, product_line, product_class, product_size, list_price, standard_cost, Profit]
Index: []

##### Delete Unused columns

***

NewCusDemo

***

In [116]:
NewCusDemo.drop(columns=["Age", "address", "postcode", "job_title", "last_name", "DOB", "first_name", 
"past_3_years_bike_related_purchases", "deceased_indicator", "country"], inplace=True)
NewCusDemo.head(2)

,customer_id,gender,job_industry_category,wealth_segment,owns_car,Name,Age_Group,state
0,1,Female,Health,Mass Customer,Yes,Laraine Medendorp,old,New South Wales
1,2,Male,Financial Services,Mass Customer,Yes,Eli Bockman,middle-aged,New South Wales

***

Transactions

***

In [117]:
Transactions.drop(columns=["order_status", "product_class", "product_size"], inplace=True)
Transactions.head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,brand,product_line,list_price,standard_cost,Profit
0,1,2,2950,2017-02-25,0.0,Solex,Standard,71.49,53.62,17.87
1,2,3,3120,2017-05-21,1.0,Trek Bicycles,Standard,2091.47,388.92,1702.55

***

Rename column

***

In [118]:
Transactions.rename(columns={"list_price": "sales"}, inplace=True)

In [119]:
Transactions.head(2)

,transaction_id,product_id,customer_id,transaction_date,online_order,brand,product_line,sales,standard_cost,Profit
0,1,2,2950,2017-02-25,0.0,Solex,Standard,71.49,53.62,17.87
1,2,3,3120,2017-05-21,1.0,Trek Bicycles,Standard,2091.47,388.92,1702.55

In [120]:
# with pd.ExcelWriter('BicycleCleaned5.xlsx') as writer:
#     NewCusDemo.to_excel(writer, sheet_name='NewCusDemo', index=False)
#     Transactions.to_excel(writer, sheet_name='Transactions', index=False)